In [38]:
import pandas as pd

In [39]:
#funcao read_csv
df = pd.read_csv("/Users/moreira/Desktop/Ciencia_Dados_2026.1/Unidade I/Dataset/gapminder.csv"
                 , delimiter=",")
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

### Dicionário de Dados - Dataset - Gapminder

- Country (country). Describes the country name
- Continent (continent). Describes the continent to which the country belongs
- Year (year). Describes the year to which the data belongs
- Life expectancy (life_exp). Describes the life expectancy for a given country in a given year
- Gross Domestic Product per capita (gdp). Describes the GDP per capita in dollars for a given country in a given year

In [40]:
df.head(30) #primeiras linhas

        country continent  year  lifeExp       pop    gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333   779.445314
1   Afghanistan      Asia  1957   30.332   9240934   820.853030
2   Afghanistan      Asia  1962   31.997  10267083   853.100710
3   Afghanistan      Asia  1967   34.020  11537966   836.197138
4   Afghanistan      Asia  1972   36.088  13079460   739.981106
5   Afghanistan      Asia  1977   38.438  14880372   786.113360
6   Afghanistan      Asia  1982   39.854  12881816   978.011439
7   Afghanistan      Asia  1987   40.822  13867957   852.395945
8   Afghanistan      Asia  1992   41.674  16317921   649.341395
9   Afghanistan      Asia  1997   41.763  22227415   635.341351
10  Afghanistan      Asia  2002   42.129  25268405   726.734055
11  Afghanistan      Asia  2007   43.828  31889923   974.580338
12      Albania    Europe  1952   55.230   1282697  1601.056136
13      Albania    Europe  1957   59.280   1476505  1942.284244
14      Albania    Europe  1962   64.820   1728137  2312.888958
15      Albania    Europe  1967   66.220   1984060  2760.196931
16      Albania    Europe  1972   67.690   2263554  3313.422188
17      Albania    Europe  1977   68.930   2509048  3533.003910
18      Albania    Europe  1982   70.420   2780097  3630.880722
19      Albania    Europe  1987   72.000   3075321  3738.932735
20      Albania    Europe  1992   71.581   3326498  2497.437901
21      Albania    Europe  1997   72.950   3428038  3193.054604
22      Albania    Europe  2002   75.651   3508512  4604.211737
23      Albania    Europe  2007   76.423   3600523  5937.029526
24      Algeria    Africa  1952   43.077   9279525  2449.008185
25      Algeria    Africa  1957   45.685  10270856  3013.976023
26      Algeria    Africa  1962   48.303  11000948  2550.816880
27      Algeria    Africa  1967   51.407  12760499  3246.991771
28      Algeria    Africa  1972   54.518  14760787  4182.663766
29      Algeria    Africa  1977   58.014  17152804  4910.416756

In [41]:
df.tail(10) #ultimas linhas

       country continent  year  lifeExp       pop   gdpPercap
1694  Zimbabwe    Africa  1962   52.358   4277736  527.272182
1695  Zimbabwe    Africa  1967   53.995   4995432  569.795071
1696  Zimbabwe    Africa  1972   55.635   5861135  799.362176
1697  Zimbabwe    Africa  1977   57.674   6642107  685.587682
1698  Zimbabwe    Africa  1982   60.363   7636524  788.855041
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [42]:
print(type(df)) #tipo de estrutura de dados

<class 'pandas.core.frame.DataFrame'>

In [43]:
df.shape #observe a quanti. de linhas e colunas

(1704, 6)

In [44]:
df.columns #nomes das colunas

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [45]:
df.dtypes #obter o dtype de cada coluna (tipo de dado)

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [46]:
df.info() #mais informacoes dos dados, como dados ausentes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [47]:
country_df = df["country"] #obtem somente a coluna country
country_df

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [48]:
country_df.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [49]:
subset = df[["country", "continent", "year"]]
subset.tail()

       country continent  year
1699  Zimbabwe    Africa  1987
1700  Zimbabwe    Africa  1992
1701  Zimbabwe    Africa  1997
1702  Zimbabwe    Africa  2002
1703  Zimbabwe    Africa  2007

In [50]:
#iloc e loc
#.loc permite fazer a selecao utilizando diretamente os rotulos do dataframe
#.iloc acessar a partir da sua posicao(indice)

In [51]:
subset.iloc[1:3] #selecionar as linhas com uso do indice

       country continent  year
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962

In [52]:
subset.iloc[50:300, 0:2]

       country continent
50   Argentina  Americas
51   Argentina  Americas
52   Argentina  Americas
53   Argentina  Americas
54   Argentina  Americas
..         ...       ...
295      China      Asia
296      China      Asia
297      China      Asia
298      China      Asia
299      China      Asia

[250 rows x 2 columns]

In [53]:
subset.loc[[1,2],["country"]]

       country
1  Afghanistan
2  Afghanistan

In [54]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [55]:
df["continent"].unique()
#retorna os valores unicos de uma coluna

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [56]:
siglas = {
    "Asia": "AS",
    "Europe":"EU",
    "Africa":"AF",
    "Americas":"AM",
    "Oceania":"OC"
}

In [57]:
subset.insert(0, "Sigla",subset["continent"].map(siglas) )

In [58]:
subset

     Sigla      country continent  year
0       AS  Afghanistan      Asia  1952
1       AS  Afghanistan      Asia  1957
2       AS  Afghanistan      Asia  1962
3       AS  Afghanistan      Asia  1967
4       AS  Afghanistan      Asia  1972
...    ...          ...       ...   ...
1699    AF     Zimbabwe    Africa  1987
1700    AF     Zimbabwe    Africa  1992
1701    AF     Zimbabwe    Africa  1997
1702    AF     Zimbabwe    Africa  2002
1703    AF     Zimbabwe    Africa  2007

[1704 rows x 4 columns]

In [ ]:
subset.pop(["continent"]) #exclui uma por vez

In [ ]:
subset

     Sigla      country continent  year
0       AS  Afghanistan      Asia  1952
1       AS  Afghanistan      Asia  1957
2       AS  Afghanistan      Asia  1962
3       AS  Afghanistan      Asia  1967
4       AS  Afghanistan      Asia  1972
...    ...          ...       ...   ...
1699    AF     Zimbabwe    Africa  1987
1700    AF     Zimbabwe    Africa  1992
1701    AF     Zimbabwe    Africa  1997
1702    AF     Zimbabwe    Africa  2002
1703    AF     Zimbabwe    Africa  2007

[1704 rows x 4 columns]

In [ ]:
subset.drop(["Sigla", "country"], axis=1) #exclui mais de uma

     continent  year
0         Asia  1952
1         Asia  1957
2         Asia  1962
3         Asia  1967
4         Asia  1972
...        ...   ...
1699    Africa  1987
1700    Africa  1992
1701    Africa  1997
1702    Africa  2002
1703    Africa  2007

[1704 rows x 2 columns]

In [ ]:
#consultas -< query()

In [ ]:
subset

     Sigla      country continent  year
0       AS  Afghanistan      Asia  1952
1       AS  Afghanistan      Asia  1957
2       AS  Afghanistan      Asia  1962
3       AS  Afghanistan      Asia  1967
4       AS  Afghanistan      Asia  1972
...    ...          ...       ...   ...
1699    AF     Zimbabwe    Africa  1987
1700    AF     Zimbabwe    Africa  1992
1701    AF     Zimbabwe    Africa  1997
1702    AF     Zimbabwe    Africa  2002
1703    AF     Zimbabwe    Africa  2007

[1704 rows x 4 columns]